# FabricationPartBrowserChangedEventArgs Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FabricationPartBrowserChangedEventArgs Methods
FabricationPartBrowserChangedEventArgs Class See Also
---
The FabricationPartBrowserChangedEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | (Inherited from RevitAPIEventArgs.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetAllSolutionsPartsTypeCounts | Returns the total fabrication part type usage count in all routing solutions. |
| GetCurrentSolutionPartTypeIds | Returns set of fabrication part types that are used in the currently selected solution. |
| GetFabricationPartTypeIds | Returns set of fabrication part types in use in the routing solution mode. |
| GetFilteredSolutionsPartsTypeCounts | Returns the active fabrication part type usage count in fitlered routing solutions. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetRequiredFabricationPartTypeIds | Returns set of required fabrication part types in use in routing solution mode. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsCancelled | Indicates whether the event is being cancelled.  (Inherited from RevitAPIEventArgs.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
FabricationPartBrowserChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace